{
  "backend/main.mo": "Motoko canister managing user registration, roles, and superadmin claiming with AccessControl integration and per-principal userId generation.",
  "feature_evidence.json": "Feature evidence report listing required frontend changes, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files including dashboards, auth pages, and routing behavior.",
  "frontend/index.css": "Tailwind CSS base/theme configuration defining color variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry page mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Manual router mapping pathname to page components with a custom 404 page.",
  "frontend/src/hooks/useActor.ts": "React hook creating and refreshing the backend actor using Internet Identity and react-query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication and client creation.",
  "frontend/src/hooks/useQueries.ts": "Defines a React Query hook that checks whether the user can create a task via an actor call.",
  "frontend/src/index.css": "Tailwind CSS setup with custom light and dark theme variables and base styling.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and the Internet Identity provider, then renders App.",
  "frontend/src/pages/_shared/PageShell.tsx": "Layout wrapper providing gradient background, centered content, and a footer.",
  "frontend/src/pages/client/ClientLogin.tsx": "Client login page with disabled Internet Identity and workspace login buttons.",
  "frontend/src/pages/client/ClientRegister.tsx": "Client registration form with disabled submit button and basic input fields.",
  "frontend/src/pages/dashboards/AdminDashboard.tsx": "Admin dashboard with static layout and disabled logout button.",
  "frontend/src/pages/dashboards/AsistenmuDashboard.tsx": "Asistenmu dashboard showing a static thank-you message and disabled logout.",
  "frontend/src/pages/dashboards/ClientDashboard.tsx": "Client dashboard that loads permission state via a query and enables or disables the task creation button.",
  "frontend/src/pages/dashboards/ConciergeDashboard.tsx": "Concierge dashboard displaying a static appreciation message with disabled logout.",
  "frontend/src/pages/dashboards/FinanceDashboard.tsx": "Finance dashboard showing a static message about financial stability with disabled logout.",
  "frontend/src/pages/dashboards/PartnerDashboard.tsx": "Partner dashboard with a static growth message and disabled logout.",
  "frontend/src/pages/dashboards/SuperadminDashboard.tsx": "Superadmin dashboard component with tabs, data formatting helpers, and user/masterdata/task management logic. Handles rendering summaries, lists, dialogs, and various admin operations.",
  "frontend/src/pages/internal/InternalLanding.tsx": "Landing page for internal users with links to login and registration. Provides simple branding and navigation UI.",
  "frontend/src/pages/internal/InternalLogin.tsx": "Internal login flow using Internet Identity, role extraction, and superadmin claim checks. Handles authentication, navigation, and warnings.",
  "frontend/src/pages/internal/InternalRegister.tsx": "Internal user registration form collecting identity and role info, submitting to backend via actor. Includes login/logout handling and success state.",
  "frontend/src/pages/Landing.tsx": "Landing page offering links for client and partner login and registration, plus internal access.",
  "frontend/src/pages/partner/PartnerLogin.tsx": "Static partner login page with disabled login options and navigation links. Provides basic UI for partner access.",
  "frontend/src/pages/partner/PartnerRegister.tsx": "Static partner registration form UI with disabled submission. Collects basic partner info fields.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters. Supports both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON describing current project state, required dashboard fixes, backend scope rules, and known issues for ongoing development."
}