{
  "backend/main.mo": "Motoko backend actor handling user registration for multiple roles, superadmin claiming, user ID generation, and access-control enforcement.",
  "feature_evidence.json": "Empty feature evidence report placeholder with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files and backend/main.mo for reference or documentation.",
  "frontend/index.css": "Tailwind base layer defining light and dark theme CSS variables and shared design tokens.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Custom router using browser history to render pages for auth flows and dashboards with a 404 fallback.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches a backend actor using the current Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity provider and hooks managing AuthClient setup, login, logout, and stored identity restoration.",
  "frontend/src/index.css": "Duplicate Tailwind-based theme token definitions controlling colors and layout primitives.",
  "frontend/src/main.tsx": "React entry that wraps App with InternetIdentityProvider and React Query client.",
  "frontend/src/pages/client/ClientLogin.tsx": "Client login page with disabled login buttons and links to registration or return.",
  "frontend/src/pages/client/ClientRegister.tsx": "Client registration form collecting basic user and company info with a submit button.",
  "frontend/src/pages/dashboards/AdminDashboard.tsx": "Admin dashboard showing a simple header and a static system stability message.",
  "frontend/src/pages/dashboards/AsistenmuDashboard.tsx": "Asistenmu dashboard displaying a static appreciation message and disabled logout.",
  "frontend/src/pages/dashboards/ClientDashboard.tsx": "Client dashboard presenting a static control-room themed message.",
  "frontend/src/pages/dashboards/ConciergeDashboard.tsx": "Concierge dashboard showing a gratitude message with disabled logout.",
  "frontend/src/pages/dashboards/FinanceDashboard.tsx": "Finance dashboard featuring a static message about maintaining financial flow.",
  "frontend/src/pages/dashboards/PartnerDashboard.tsx": "Partner dashboard with a static message about growth and responsibility.",
  "frontend/src/pages/dashboards/SuperadminDashboard.tsx": "Superadmin dashboard showing a static message about full system control.",
  "frontend/src/pages/internal/InternalLanding.tsx": "Internal landing page offering links to internal login and registration.",
  "frontend/src/pages/internal/InternalLogin.tsx": "Internal login page with selectable roles and disabled login actions.",
  "frontend/src/pages/internal/InternalRegister.tsx": "Static internal registration form with fields for name, email, WhatsApp, and role selection. Contains no backend logic and only renders UI components.",
  "frontend/src/pages/Landing.tsx": "Landing page offering client, partner, and internal access links with registration options.",
  "frontend/src/pages/partner/PartnerLogin.tsx": "Static partner login page showing two disabled login buttons and links to register or return home. Includes footer with dynamic year and external link.",
  "frontend/src/pages/partner/PartnerRegister.tsx": "Static partner registration form collecting name, email, WhatsApp, skills, and domicile. Provides only UI layout with no functional submission logic.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, retrieving, and clearing URL parameters and session-stored values. Supports both query-string and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, and container settings. Enables typography, container queries, and animation plugins.",
  "project_state.json": "Project metadata describing frontend constraints and detailed backend modification rules, including append-only requirements and role/user ID logic specifications."
}