{
  "backend/main.mo": "Motoko backend actor managing user IDs, role-based registration, and a one-time superadmin claim with access-control enforcement.",
  "feature_evidence.json": "Feature evidence report listing three InternalLogin.tsx modifications related to superadmin claim UI, handler hardening, and mutation rules.",
  "frontend-file-summaries.txt": "List of prewritten summaries describing every frontend file’s purpose and behavior.",
  "frontend/index.css": "Tailwind base layer defining OKLCH design tokens, light/dark theme variables, and global element styling.",
  "frontend/index.html": "HTML shell that loads the React app root and boots main.tsx.",
  "frontend/src/App.tsx": "Manual history-based router selecting page components for all routes with a 404 fallback.",
  "frontend/src/hooks/useActor.ts": "React hook creating and caching an authenticated or anonymous backend actor, auto-refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity auth, offering identity state, login, logout, and status handling.",
  "frontend/src/hooks/useQueries.ts": "Defines a React Query hook that checks whether the current actor can create a task UI.",
  "frontend/src/index.css": "Tailwind setup defining light and dark theme CSS variables and base styling.",
  "frontend/src/main.tsx": "Initializes React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/client/ClientLogin.tsx": "Client login page showing disabled login options and navigation links.",
  "frontend/src/pages/client/ClientRegister.tsx": "Client registration form collecting basic user info like name, email, WhatsApp, and company.",
  "frontend/src/pages/dashboards/AdminDashboard.tsx": "Admin dashboard with a static message and disabled logout button.",
  "frontend/src/pages/dashboards/AsistenmuDashboard.tsx": "Dashboard for assistant users displaying a thank‑you message.",
  "frontend/src/pages/dashboards/ClientDashboard.tsx": "Client dashboard showing a create‑task button enabled based on query result.",
  "frontend/src/pages/dashboards/ConciergeDashboard.tsx": "Concierge dashboard with a gratitude message and disabled logout.",
  "frontend/src/pages/dashboards/FinanceDashboard.tsx": "Finance dashboard displaying a message about maintaining financial health.",
  "frontend/src/pages/dashboards/PartnerDashboard.tsx": "Static partner dashboard page showing a header with disabled logout and a centered welcome message.",
  "frontend/src/pages/dashboards/SuperadminDashboard.tsx": "Static superadmin dashboard page with a disabled logout button and a central control message.",
  "frontend/src/pages/internal/InternalLanding.tsx": "Landing page for internal users providing navigation to login and registration flows.",
  "frontend/src/pages/internal/InternalLogin.tsx": "Internal login page handling Internet Identity auth, role selection, and superadmin-claim logic.",
  "frontend/src/pages/internal/InternalRegister.tsx": "Static internal registration form collecting basic user details and role.",
  "frontend/src/pages/Landing.tsx": "Landing page with login and registration links for client and partner users.",
  "frontend/src/pages/partner/PartnerLogin.tsx": "Partner login page with disabled authentication buttons and links to registration.",
  "frontend/src/pages/partner/PartnerRegister.tsx": "Partner registration form collecting personal info, skills, and location.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining dark mode, content paths, extended color/theme settings, animations, and plugins.",
  "project_state.json": "Project metadata describing frontend/static UI rules, backend scope, known issues, and architectural constraints for current development."
}