{
  "backend/main.mo": "Motoko backend managing user IDs, roles, registration flows, and one-time superadmin claiming with access‑control enforcement.",
  "feature_evidence.json": "Feature evidence report listing required frontend changes for InternalLogin superadmin-claim behavior and related checks.",
  "frontend-file-summaries.txt": "Prewritten summaries describing behavior and styling of all frontend pages and components.",
  "frontend/index.css": "Tailwind base/theme configuration defining color variables, dark mode values, and global styling rules.",
  "frontend/index.html": "Basic HTML shell loading the React app root and main.tsx script.",
  "frontend/src/App.tsx": "Manual history-based router selecting React pages and dashboards plus a fallback 404 view.",
  "frontend/src/hooks/useActor.ts": "React hook creating and caching a backend actor tied to Internet Identity, reinitializing access control and invalidating queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and provider handling Internet Identity login, stored identities, status flags, and logout utilities.",
  "frontend/src/hooks/useQueries.ts": "Defines a React Query hook that checks if the current actor can create a task UI.",
  "frontend/src/index.css": "Tailwind CSS setup defining color variables and themes for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/_shared/PageShell.tsx": "Layout wrapper providing centered content area and footer styling.",
  "frontend/src/pages/client/ClientLogin.tsx": "Client login page with disabled login buttons and navigation links.",
  "frontend/src/pages/client/ClientRegister.tsx": "Client registration form with disabled submit and fields for personal details.",
  "frontend/src/pages/dashboards/AdminDashboard.tsx": "Admin dashboard showing a static message and disabled logout.",
  "frontend/src/pages/dashboards/AsistenmuDashboard.tsx": "Asistenmu dashboard presenting a thank‑you message and disabled logout.",
  "frontend/src/pages/dashboards/ClientDashboard.tsx": "Client dashboard displaying a task creation button controlled by a permission query.",
  "frontend/src/pages/dashboards/ConciergeDashboard.tsx": "Concierge dashboard with a gratitude message and disabled logout.",
  "frontend/src/pages/dashboards/FinanceDashboard.tsx": "Finance dashboard with a stability message and disabled logout.",
  "frontend/src/pages/dashboards/PartnerDashboard.tsx": "Partner dashboard showing a motivational message and disabled logout.",
  "frontend/src/pages/dashboards/SuperadminDashboard.tsx": "Superadmin dashboard displaying a system control message and disabled logout.",
  "frontend/src/pages/internal/InternalLanding.tsx": "Internal landing page offering internal login and registration options.",
  "frontend/src/pages/internal/InternalLogin.tsx": "Internal login page with Internet Identity auth, role extraction, superadmin-claim check, and redirect logic to internal dashboards.",
  "frontend/src/pages/internal/InternalRegister.tsx": "Static internal registration form UI with fields for name, email, WhatsApp, and role, plus disabled submit button.",
  "frontend/src/pages/Landing.tsx": "Landing page offering login and registration options for client, partner, and internal users.",
  "frontend/src/pages/partner/PartnerLogin.tsx": "Static partner login page showing disabled login buttons and navigation links.",
  "frontend/src/pages/partner/PartnerRegister.tsx": "Static partner registration form UI with profile fields and a disabled submit button.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, storing/retrieving them from sessionStorage, and clearing them.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, shadows, animations, and enabling plugins.",
  "project_state.json": "Project state metadata describing current scope, constraints, known issues, and architecture rules."
}