{
  "backend/main.mo": "Motoko backend actor handling user registration for multiple roles, superadmin claiming, and access control integration with generated user IDs.",
  "feature_evidence.json": "Feature evidence report listing two frontend patches related to InternalLogin behavior and their associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of all frontend source files including pages, dashboards, hooks, and backend reference.",
  "frontend/index.css": "Tailwind base/theme CSS defining OKLCH color tokens and dark mode variables for global styling.",
  "frontend/index.html": "Static HTML entry file containing root div and script loader for the frontend React app.",
  "frontend/src/App.tsx": "React app using manual pathname-based routing to render pages and dashboards without external router libraries.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated or anonymous backend actor, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity provider and hook managing AuthClient login, stored identity restoration, and logout behavior.",
  "frontend/src/hooks/useQueries.ts": "React Query hook calling actor.canCreateTaskUI to determine task creation UI permissions.",
  "frontend/src/index.css": "Tailwind setup defining extensive CSS variables for themes and applying global base styles.",
  "frontend/src/main.tsx": "React entry point initializing QueryClient and wrapping App with providers.",
  "frontend/src/pages/client/ClientLogin.tsx": "Client login page displaying disabled login options and navigation links.",
  "frontend/src/pages/client/ClientRegister.tsx": "Client registration form with fields for name, email, WhatsApp, and company.",
  "frontend/src/pages/dashboards/AdminDashboard.tsx": "Admin dashboard with a disabled logout button and a simple status message.",
  "frontend/src/pages/dashboards/AsistenmuDashboard.tsx": "Assistant dashboard showing a gratitude message and disabled logout.",
  "frontend/src/pages/dashboards/ClientDashboard.tsx": "Client dashboard showing task creation availability via query hook.",
  "frontend/src/pages/dashboards/ConciergeDashboard.tsx": "Concierge dashboard displaying an appreciation message and disabled logout.",
  "frontend/src/pages/dashboards/FinanceDashboard.tsx": "Finance dashboard with a message about maintaining healthy flow and disabled logout.",
  "frontend/src/pages/dashboards/PartnerDashboard.tsx": "Partner dashboard with a motivational message and disabled logout.",
  "frontend/src/pages/dashboards/SuperadminDashboard.tsx": "Superadmin dashboard displaying a control message and disabled logout.",
  "frontend/src/pages/internal/InternalLanding.tsx": "Internal access landing page offering internal login and registration options.",
  "frontend/src/pages/internal/InternalLogin.tsx": "Implements internal login flow using Internet Identity, handling role extraction, superadmin claim checks, and navigation based on user role.",
  "frontend/src/pages/internal/InternalRegister.tsx": "Static internal registration form with fields for name, email, WhatsApp, and role selection.",
  "frontend/src/pages/Landing.tsx": "Landing page offering client and partner login or registration links.",
  "frontend/src/pages/partner/PartnerLogin.tsx": "Partner login page with disabled Internet Identity and workspace login buttons, plus navigation links.",
  "frontend/src/pages/partner/PartnerRegister.tsx": "Static partner registration form collecting basic info, skills, and domicile.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session storage values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and layout settings with plugins.",
  "project_state.json": "Defines current project state, scope, architectural rules, known issues, and feature constraints for frontend and backend. Highlights that only backend/main.mo may change for the current fix request and that the frontend must remain static except InternalLogin.tsx."
}