{
  "backend/main.mo": "Motoko actor managing user registration, role assignment, userId generation, and superadmin claiming with access control.",
  "backend/migration.mo": "Migration module converting old user role structures to the new format while preserving IDs and flags.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Prewritten summaries for various frontend and backend files.",
  "frontend/index.css": "Global Tailwind-based CSS theme defining OKLCH color variables for light and dark modes.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx.",
  "frontend/src/App.tsx": "React app handling route-based rendering without a router using manual pathname switching.",
  "frontend/src/hooks/useActor.ts": "Hook creating a backend actor tied to Internet Identity and refetching dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Hook and provider managing Internet Identity login, stored identity loading, and auth client lifecycle.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/pages/client/ClientLogin.tsx": "Client login page with disabled login buttons and navigation links.",
  "frontend/src/pages/client/ClientRegister.tsx": "Client registration form collecting basic user info like name, email, WhatsApp, and company.",
  "frontend/src/pages/dashboards/AdminDashboard.tsx": "Admin dashboard showing a static welcome message and disabled logout.",
  "frontend/src/pages/dashboards/AsistenmuDashboard.tsx": "Asistenmu dashboard displaying a static appreciation message and disabled logout.",
  "frontend/src/pages/dashboards/ClientDashboard.tsx": "Client dashboard with a simple control-room message and disabled logout.",
  "frontend/src/pages/dashboards/ConciergeDashboard.tsx": "Concierge dashboard showing a gratitude message and disabled logout.",
  "frontend/src/pages/dashboards/FinanceDashboard.tsx": "Finance dashboard with a financial health message and disabled logout.",
  "frontend/src/pages/dashboards/PartnerDashboard.tsx": "Partner dashboard presenting a growth-oriented message and disabled logout.",
  "frontend/src/pages/dashboards/SuperadminDashboard.tsx": "Superadmin dashboard with a system-control message and disabled logout.",
  "frontend/src/pages/internal/InternalLanding.tsx": "Internal landing page offering links to internal login and registration.",
  "frontend/src/pages/internal/InternalLogin.tsx": "Provides a static internal login UI allowing role selection with disabled login buttons.",
  "frontend/src/pages/internal/InternalRegister.tsx": "Renders a static internal registration form with fields for name, email, WhatsApp, and role.",
  "frontend/src/pages/Landing.tsx": "Landing page offering login and registration links for clients, partners, and internal users.",
  "frontend/src/pages/partner/PartnerLogin.tsx": "Displays a partner login page with disabled authentication buttons and navigation links.",
  "frontend/src/pages/partner/PartnerRegister.tsx": "Shows a partner registration form including personal details, WhatsApp, skills, and domicile fields.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, writing, and persisting URL parameters via query strings, hash, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending themes, colors, animations, and including typography and container query plugins.",
  "project_state.json": "Defines backend-only modification rules, architectural notes, known issues, and existing features for the project. Specifies strict constraints for updating backend/main.mo while keeping all frontend files unchanged."
}