{
  "backend/main.mo": "Motoko canister managing access control, approval workflows, and user registration for client, partner, and internal roles with ID generation.",
  "feature_evidence.json": "Feature evidence describing required frontend dashboard changes and validation steps referencing ClientDashboard.tsx.",
  "frontend-file-summaries.txt": "List of summarized descriptions for numerous frontend files, outlining routing, UI behavior, and dashboard features.",
  "frontend/index.css": "Tailwind base/theme setup defining color tokens, CSS variables, and light/dark mode styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Manual client-side router mapping paths to page components including dashboards, auth pages, and a 404 fallback.",
  "frontend/src/hooks/useActor.ts": "React hook creating and caching a backend actor based on Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks managing Internet Identity login, state persistence, and AuthClient configuration.",
  "frontend/src/hooks/useQueries.ts": "Small placeholder hook wrapping a React Query call for a not-yet-implemented backend method.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines extensive light/dark theme CSS variables and base styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider and imports global CSS.",
  "frontend/src/pages/_shared/PageShell.tsx": "Provides a shared page wrapper with centered content, gradient background, and footer.",
  "frontend/src/pages/client/ClientLogin.tsx": "Client login page with disabled login options and links to registration and home.",
  "frontend/src/pages/client/ClientRegister.tsx": "Client registration form with input fields and disabled submit button.",
  "frontend/src/pages/dashboards/AdminDashboard.tsx": "Simple admin dashboard layout with header, disabled logout button, and status message.",
  "frontend/src/pages/dashboards/AsistenmuDashboard.tsx": "Dashboard for Asistenmu users showing a thank‑you message with standard header/footer.",
  "frontend/src/pages/dashboards/ClientDashboard.tsx": "Client dashboard fetching active services, preparing task buckets, and handling phase logic (tasks currently empty).",
  "frontend/src/pages/dashboards/ConciergeDashboard.tsx": "Dashboard for Concierge users displaying a gratitude message with shared layout.",
  "frontend/src/pages/dashboards/FinanceDashboard.tsx": "Finance dashboard showing a health‑of‑flows status message with disabled logout.",
  "frontend/src/pages/dashboards/PartnerDashboard.tsx": "Partner dashboard presenting a motivational message within the shared gradient layout.",
  "frontend/src/pages/dashboards/SuperadminDashboard.tsx": "Superadmin dashboard with tabs for summary, users, master data, rates, tasks, and layanan, managing extensive UI state and backend interactions.",
  "frontend/src/pages/external/ClientLogin.tsx": "Client login page handling Internet Identity login, user validation, and redirecting to registration or dashboard.",
  "frontend/src/pages/external/ClientRegister.tsx": "Client registration page collecting profile data, submitting to backend, and redirecting after success.",
  "frontend/src/pages/external/PartnerLogin.tsx": "Partner login page using Internet Identity, verifying partner role, and routing to registration or dashboard.",
  "frontend/src/pages/external/PartnerRegister.tsx": "Partner registration page for submitting profile details and navigating to dashboard after successful registration.",
  "frontend/src/pages/internal/InternalLanding.tsx": "Simple internal landing page linking to login and registration for internal users.",
  "frontend/src/pages/internal/InternalLogin.tsx": "Handles internal user authentication with Internet Identity, role extraction, superadmin claim checks, and redirects to role-specific dashboards.",
  "frontend/src/pages/internal/InternalRegister.tsx": "Provides a form for internal staff registration using Internet Identity and submits profile data to the backend actor.",
  "frontend/src/pages/Landing.tsx": "Landing page offering client and partner login/registration links with styled layout.",
  "frontend/src/pages/partner/PartnerLogin.tsx": "Displays a disabled partner login page with UI elements for future authentication and navigation links.",
  "frontend/src/pages/partner/PartnerRegister.tsx": "Shows a disabled partner registration form collecting basic personal and skill information.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, and clearing URL parameters with session persistence and hash support.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme settings, colors, components, container behavior, animations, and plugins.",
  "project_state.json": "Tracks project state version, scope updates for ClientDashboard changes, and architectural rules. Lists known frontend/backend issues affecting routing, role handling, and superadmin claim flow."
}