{
  "backend/main.mo": "Motoko actor handling access control, user approvals, and registration for client, partner, and internal roles with ID generation and permission checks.",
  "feature_evidence.json": "Feature evidence report listing required frontend modifications and sanity checks for the Superadmin dashboard along with related components and test IDs.",
  "frontend-file-summaries.txt": "Pre-computed summaries describing the purpose and behavior of various frontend pages including dashboards, auth screens, and internal flows.",
  "frontend/index.css": "Tailwind base configuration defining light/dark theme CSS variables and applying global background and border styles.",
  "frontend/index.html": "Static HTML entry point loading the React app via main.tsx into the root div.",
  "frontend/src/App.tsx": "Manual router component mapping URL paths to corresponding pages including dashboards, external auth pages, and internal flows.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated or anonymous backend actor, reinitializing on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and provider for managing Internet Identity login state, persistence, and delegated identities.",
  "frontend/src/hooks/useQueries.ts": "Placeholder React Query hook using the actor to check task creation permissions, currently returning a static false value.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes plus base element styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, then renders App.",
  "frontend/src/pages/_shared/PageShell.tsx": "Provides a shared page wrapper with a gradient background, centered content, and footer.",
  "frontend/src/pages/client/ClientLogin.tsx": "Client login page with disabled login options and links to registration or back navigation.",
  "frontend/src/pages/client/ClientRegister.tsx": "Client registration form UI with disabled submission and several input fields.",
  "frontend/src/pages/dashboards/AdminDashboard.tsx": "Admin dashboard showing a simple static message with disabled logout.",
  "frontend/src/pages/dashboards/AsistenmuDashboard.tsx": "Dashboard for Asistenmu role displaying a thank‑you message and disabled logout.",
  "frontend/src/pages/dashboards/ClientDashboard.tsx": "Client dashboard showing task creation button controlled by query state.",
  "frontend/src/pages/dashboards/ConciergeDashboard.tsx": "Concierge dashboard with a gratitude message and disabled logout.",
  "frontend/src/pages/dashboards/FinanceDashboard.tsx": "Finance dashboard showing a finance‑themed status message with disabled logout.",
  "frontend/src/pages/dashboards/PartnerDashboard.tsx": "Partner dashboard presenting a motivational message with disabled logout.",
  "frontend/src/pages/dashboards/SuperadminDashboard.tsx": "Large superadmin UI managing tabs for summaries, users, master data, and configurations with extensive state management.",
  "frontend/src/pages/external/ClientLogin.tsx": "Handles Internet Identity login for clients and routes them to registration or dashboard based on backend user lookup.",
  "frontend/src/pages/external/ClientRegister.tsx": "Provides client registration with form validation and backend submission, then redirects to dashboard after success.",
  "frontend/src/pages/external/PartnerLogin.tsx": "Handles Internet Identity login for partners and routes them to registration or dashboard based on backend user lookup.",
  "frontend/src/pages/external/PartnerRegister.tsx": "Provides partner registration with form validation and backend submission, then redirects to dashboard after success.",
  "frontend/src/pages/internal/InternalLanding.tsx": "Simple landing page offering links to internal login and registration.",
  "frontend/src/pages/internal/InternalLogin.tsx": "Manages internal user authentication, role extraction, superadmin claim checks, and routing to appropriate dashboards.",
  "frontend/src/pages/internal/InternalRegister.tsx": "Registration page for internal users with login, role selection, and form submission using backend actor methods.",
  "frontend/src/pages/Landing.tsx": "Landing page offering client and partner login/registration links with styled layout.",
  "frontend/src/pages/partner/PartnerLogin.tsx": "Static partner login page with disabled login buttons and links to registration and home.",
  "frontend/src/pages/partner/PartnerRegister.tsx": "Static partner registration form with disabled submit button and basic input fields.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and sessionStorage parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, and plugins for the project.",
  "project_state.json": "Project metadata describing version, constraints, requirements, and known issues for backend and frontend development."
}