{
  "backend/main.mo": "Motoko canister implementing user registration for client, partner, internal, and superadmin roles with access control and per‑principal user IDs.",
  "feature_evidence.json": "Empty feature evidence report JSON structure.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing layout, routing, and dashboard pages.",
  "frontend/index.css": "Tailwind CSS base layer defining color variables and theme tokens for light and dark modes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "React app implementing manual path-based routing to all pages and a custom 404 component.",
  "frontend/src/hooks/useActor.ts": "React hook creating and caching a backend actor using identity, with query invalidation on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity provider and hook managing login, stored identities, and auth client lifecycle.",
  "frontend/src/hooks/useQueries.ts": "React-query wrapper checking if the actor allows task creation via canCreateTaskUI.",
  "frontend/src/index.css": "Duplicate Tailwind theme variables and global styles for the frontend build.",
  "frontend/src/main.tsx": "React entry file mounting App with Internet Identity and react-query providers.",
  "frontend/src/pages/_shared/PageShell.tsx": "Layout wrapper providing centered content area and footer branding.",
  "frontend/src/pages/client/ClientLogin.tsx": "Client login page with disabled authentication buttons and links to register or return.",
  "frontend/src/pages/client/ClientRegister.tsx": "Client registration form with disabled submit button and fields for basic user info.",
  "frontend/src/pages/dashboards/AdminDashboard.tsx": "Static admin dashboard showing a short status message and disabled logout.",
  "frontend/src/pages/dashboards/AsistenmuDashboard.tsx": "Static dashboard for Asistenmu role displaying a thank‑you message and disabled logout.",
  "frontend/src/pages/dashboards/ClientDashboard.tsx": "Client dashboard allowing task creation based on API query state.",
  "frontend/src/pages/dashboards/ConciergeDashboard.tsx": "Static concierge dashboard with a service‑appreciation message and disabled logout.",
  "frontend/src/pages/dashboards/FinanceDashboard.tsx": "Static finance dashboard showing a financial‑health message and disabled logout.",
  "frontend/src/pages/dashboards/PartnerDashboard.tsx": "Static partner dashboard with a growth‑focused message and disabled logout.",
  "frontend/src/pages/dashboards/SuperadminDashboard.tsx": "Static superadmin dashboard indicating full system control and disabled logout.",
  "frontend/src/pages/internal/InternalLanding.tsx": "Internal access landing page linking to internal login and registration.",
  "frontend/src/pages/internal/InternalLogin.tsx": "Internal login with Internet Identity integration, role extraction, and superadmin claim checks.",
  "frontend/src/pages/internal/InternalRegister.tsx": "Static internal registration form UI with inputs for name, email, WhatsApp, and role; submit button is disabled.",
  "frontend/src/pages/Landing.tsx": "Landing page offering navigation to client, partner, and internal access options.",
  "frontend/src/pages/partner/PartnerLogin.tsx": "Static partner login page showing two disabled login buttons and links for registration and home.",
  "frontend/src/pages/partner/PartnerRegister.tsx": "Static partner registration form with fields for personal info, skills, and domicile; submit button is disabled.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and clearing them from URL or storage.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending theme colors, layout, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Metadata file describing project state, backend fix requirements, architectural rules, and known issues."
}