{
  "backend/main.mo": "Motoko backend defining user ID generation, role registration (client, partner, internal), superadmin claiming, and access-control-gated user role storage.",
  "feature_evidence.json": "Machine-generated report listing feature requirements, affected files, components, and test IDs for the InternalLogin flow and related UI behaviors.",
  "frontend-file-summaries.txt": "Text file containing human-written one‑sentence summaries for each frontend and backend source file.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables for light and dark modes and global element styling.",
  "frontend/index.html": "Minimal HTML host page loading the React app entrypoint into the root div.",
  "frontend/src/App.tsx": "Manual router using the browser history API to switch between landing, auth, internal, and dashboard pages.",
  "frontend/src/hooks/useActor.ts": "React hook creating a backend actor tied to the Internet Identity session and refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity state and login flow using Dfinity's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines a React Query hook that checks via an actor whether the user can create a task.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme CSS variables and base styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/client/ClientLogin.tsx": "Client login page with disabled login options and navigation links.",
  "frontend/src/pages/client/ClientRegister.tsx": "Client registration form collecting basic user information.",
  "frontend/src/pages/dashboards/AdminDashboard.tsx": "Admin dashboard showing a static welcome message and disabled logout button.",
  "frontend/src/pages/dashboards/AsistenmuDashboard.tsx": "Asistenmu dashboard displaying a thank-you message with a disabled logout button.",
  "frontend/src/pages/dashboards/ClientDashboard.tsx": "Client dashboard that conditionally enables task creation based on a query result.",
  "frontend/src/pages/dashboards/ConciergeDashboard.tsx": "Concierge dashboard showing a static appreciation message and disabled logout button.",
  "frontend/src/pages/dashboards/FinanceDashboard.tsx": "Finance dashboard displaying a static message about maintaining financial health.",
  "frontend/src/pages/dashboards/PartnerDashboard.tsx": "Renders a simple partner dashboard layout with disabled logout and a welcome message.",
  "frontend/src/pages/dashboards/SuperadminDashboard.tsx": "Displays the superadmin dashboard layout with disabled logout and a control-focused message.",
  "frontend/src/pages/internal/InternalLanding.tsx": "Landing page for internal users with links to login and registration plus footer attribution.",
  "frontend/src/pages/internal/InternalLogin.tsx": "Handles internal login flow, role selection, identity checks, and navigation based on backend user roles.",
  "frontend/src/pages/internal/InternalRegister.tsx": "Static internal registration form with fields for basic user info and role selection.",
  "frontend/src/pages/Landing.tsx": "Landing page with login and registration links for client and partner users.",
  "frontend/src/pages/partner/PartnerLogin.tsx": "Partner login screen with disabled authentication buttons and navigation links.",
  "frontend/src/pages/partner/PartnerRegister.tsx": "Partner registration form collecting personal info, WhatsApp, skills, and domicile.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for getting, storing, and clearing URL and session parameters, supporting hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH color tokens, extended theme options, animations, and three plugins.",
  "project_state.json": "Defines current project state, frontend restrictions, backend scope notes, and known issues for planning."
}