{
  "backend/main.mo": "Motoko canister managing access control, user approvals, and registration for client, partner, internal, and superadmin roles with ID generation and permission checks.",
  "feature_evidence.json": "Empty feature evidence report stub with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the function and routing behavior of each frontend page component.",
  "frontend/index.css": "Global Tailwind CSS config defining color variables, theme layers, and dark mode tokens.",
  "frontend/index.html": "Base HTML shell that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Custom manual router using window history to load landing, auth pages, dashboards, and fallback 404 component.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches a backend actor tied to Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity authentication handling login, stored identities, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder React Query hook for a future canCreateTaskUI backend method.",
  "frontend/src/index.css": "Duplicate Tailwind CSS theme variables and base styles matching frontend/index.css.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/_shared/PageShell.tsx": "Layout wrapper providing centered content area and a footer.",
  "frontend/src/pages/client/ClientLogin.tsx": "Client login UI with disabled authentication buttons and navigation links.",
  "frontend/src/pages/client/ClientRegister.tsx": "Client registration form UI with disabled submit button and basic fields.",
  "frontend/src/pages/dashboards/AdminDashboard.tsx": "Admin dashboard displaying a static message with a disabled logout button.",
  "frontend/src/pages/dashboards/AsistenmuDashboard.tsx": "Assistant dashboard showing a thank‑you message and disabled logout button.",
  "frontend/src/pages/dashboards/ClientDashboard.tsx": "Client dashboard that checks task creation permission and enables a task button accordingly.",
  "frontend/src/pages/dashboards/ConciergeDashboard.tsx": "Concierge dashboard showing a static appreciation message with disabled logout.",
  "frontend/src/pages/dashboards/FinanceDashboard.tsx": "Finance dashboard with a static system message and disabled logout.",
  "frontend/src/pages/dashboards/PartnerDashboard.tsx": "Partner dashboard showing a growth‑focused message and disabled logout.",
  "frontend/src/pages/dashboards/SuperadminDashboard.tsx": "Superadmin dashboard handling identity state, logout, and displaying actor fetch status.",
  "frontend/src/pages/external/ClientLogin.tsx": "External client login flow using Internet Identity and actor checks before redirecting to dashboard.",
  "frontend/src/pages/external/ClientRegister.tsx": "Client registration page handling Internet Identity login, form validation, and submitting a client profile via actor API.",
  "frontend/src/pages/external/PartnerLogin.tsx": "Partner login page supporting Internet Identity authentication and redirecting users to registration or dashboard based on role.",
  "frontend/src/pages/external/PartnerRegister.tsx": "Partner registration page managing II login, form input, and submitting a partner profile to the backend.",
  "frontend/src/pages/internal/InternalLanding.tsx": "Simple landing page linking to internal login and registration pages.",
  "frontend/src/pages/internal/InternalLogin.tsx": "Internal login page handling II auth, role extraction, superadmin claim checks, and dashboard routing.",
  "frontend/src/pages/internal/InternalRegister.tsx": "Internal user registration form allowing II login and submission of internal roles and profile info via actor API.",
  "frontend/src/pages/Landing.tsx": "Landing page offering client and partner login/registration options plus internal link.",
  "frontend/src/pages/partner/PartnerLogin.tsx": "Static partner login UI with disabled actions and links to partner registration.",
  "frontend/src/pages/partner/PartnerRegister.tsx": "Renders a partner registration form with fields for personal info, skills, and a disabled submit button inside a styled PageShell.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read, persist, and clear URL parameters with sessionStorage fallback and hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with extended color tokens, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, backend scope rules, architectural notes, and known issues for the current build state."
}