{
  "backend/main.mo": "Actor managing user registration for client, partner, internal roles and a single superadmin, with access control checks and per-principal user IDs.",
  "feature_evidence.json": "Structured feature evidence listing required frontend files, behaviors, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file summarizing various frontend pages and dashboards with their behaviors and UI details.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and base styling.",
  "frontend/index.html": "Base HTML file mounting the React app via root div and main.tsx script.",
  "frontend/src/App.tsx": "Manual SPA router mapping URL paths to page components with a 404 fallback.",
  "frontend/src/hooks/useActor.ts": "React hook creating and caching a backend actor based on Internet Identity authentication and auto-initializing access control.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication with AuthClient, including login state and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Defines a React Query hook that checks if the current actor can create a task via canCreateTaskUI.",
  "frontend/src/index.css": "Configures Tailwind layers and design tokens for light and dark themes with global styling rules.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/_shared/PageShell.tsx": "Provides a page layout wrapper with a gradient background and footer for consistent UI structure.",
  "frontend/src/pages/client/ClientLogin.tsx": "Client login page with disabled Internet Identity and workspace login buttons.",
  "frontend/src/pages/client/ClientRegister.tsx": "Client registration form page with disabled submission and basic input fields.",
  "frontend/src/pages/dashboards/AdminDashboard.tsx": "Admin dashboard showing a static message and disabled logout button in a styled layout.",
  "frontend/src/pages/dashboards/AsistenmuDashboard.tsx": "Asistenmu dashboard displaying a thank-you message with a disabled logout button.",
  "frontend/src/pages/dashboards/ClientDashboard.tsx": "Client dashboard that conditionally enables task creation based on canCreateTaskUI query results.",
  "frontend/src/pages/dashboards/ConciergeDashboard.tsx": "Concierge dashboard presenting a gratitude message with static layout and disabled logout.",
  "frontend/src/pages/dashboards/FinanceDashboard.tsx": "Finance dashboard showing a stability message with a standard themed layout.",
  "frontend/src/pages/dashboards/PartnerDashboard.tsx": "Partner dashboard offering a motivational message within the shared dashboard layout.",
  "frontend/src/pages/dashboards/SuperadminDashboard.tsx": "Superadmin dashboard component with data helpers, tab structure, and types for managing users, master data, rates, and tasks.",
  "frontend/src/pages/external/ClientLogin.tsx": "Client login page handling Internet Identity login and routing to registration or dashboard based on user role.",
  "frontend/src/pages/external/ClientRegister.tsx": "Client registration form that collects profile data, registers via actor API, and redirects to the workspace after success.",
  "frontend/src/pages/external/PartnerLogin.tsx": "Partner login page managing Internet Identity authentication and workspace access with role validation.",
  "frontend/src/pages/external/PartnerRegister.tsx": "Partner registration form collecting profile details, submitting to backend, and routing to dashboard upon success.",
  "frontend/src/pages/internal/InternalLanding.tsx": "Landing page for internal users providing navigation links to internal login and registration.",
  "frontend/src/pages/internal/InternalLogin.tsx": "Handles internal user login via Internet Identity, checks role and superadmin claim status, and redirects to appropriate dashboards.",
  "frontend/src/pages/internal/InternalRegister.tsx": "Provides a form for internal user registration, handling role selection, data submission, and Internet Identity login state.",
  "frontend/src/pages/Landing.tsx": "Landing page offering login and registration links for clients, partners, and internal access.",
  "frontend/src/pages/partner/PartnerLogin.tsx": "Renders a disabled partner login page with UI elements and links to registration and home.",
  "frontend/src/pages/partner/PartnerRegister.tsx": "Displays a static partner registration form UI with disabled submission and navigation back to login.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with sessionStorage support.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins for the project.",
  "project_state.json": "Defines project state, scope limits, and rules for modifying specific frontend and backend files. Lists architectural constraints, known issues, and the required behavior for login and registration flows using Internet Identity."
}