{
  "kind": "build_request",
  "title": "Fix InternalLogin superadmin-claim timing and error handling (no redirect; hide card on success)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-110",
      "text": "Update `frontend/src/pages/internal/InternalLogin.tsx` so the one-time `isSuperadminClaimed()` check completes promptly after the backend actor becomes ready (i.e., once `actor` exists and `actorFetching` is false), ensuring the Claim Superadmin card does not take minutes to appear when it should be visible.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Yang pertama pengecekan is actor ini lebih dari 5 menit sampai muncul card claim superadmin",
          "1. Iya langsung diperbaiki alurnya."
        ]
      },
      "acceptanceCriteria": [
        "After a successful Internet Identity login, once `actor` is available and `actorFetching === false`, the app performs the `isSuperadminClaimed()` check and sets `claimCheckDone === true` without multi-minute delay.",
        "If `isSuperadminClaimed()` returns `false`, the Claim Superadmin card becomes visible immediately after `claimCheckDone === true` (subject to existing visibility rules).",
        "The claim-check logic must not spam the backend (at most one check per actor-ready session unless the user logs out and logs in again)."
      ]
    },
    {
      "id": "REQ-111",
      "text": "Update `frontend/src/pages/internal/InternalLogin.tsx` so a successful Superadmin claim permanently hides the Claim Superadmin card with no navigation/redirect. The claim action must still call ONLY `actor.claimSuperadmin()` and must not invoke any other backend mutation directly or indirectly.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Tidak perlu ada redirected cukup saat superadmin telah terclaim hilangkan kartunya secara permanan"
        ]
      },
      "acceptanceCriteria": [
        "On successful `actor.claimSuperadmin()` resolution, the UI sets `superadminClaimed = true` and the Claim Superadmin card is no longer rendered.",
        "No navigation occurs on success (do not call `navigateToPath('/superadmin/dashboard')` or equivalent).",
        "The claim click handler calls ONLY `actor.claimSuperadmin()` as the mutation; no other backend mutation (e.g., profile/role assignment) is triggered from this handler."
      ]
    },
    {
      "id": "REQ-112",
      "text": "Update `frontend/src/pages/internal/InternalLogin.tsx` claim error handling so the red error message is shown only when the claim truly fails. On claim errors, the UI must perform a single follow-up `isSuperadminClaimed()` re-check: if now claimed, treat as success (hide card permanently, no redirect); otherwise show a friendly error message and do not expose raw backend authorization strings to the user.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "saat claim error msg itu muncul saya ingin flow claim ini berjalan dengan baik",
          "Tampilkan bila benar benar gagal"
        ]
      },
      "acceptanceCriteria": [
        "If `claimSuperadmin()` throws, the UI performs exactly one follow-up call to `isSuperadminClaimed()` (when available).",
        "If the follow-up check indicates claimed, the UI sets `superadminClaimed = true`, hides the Claim Superadmin card, and does not show an error banner (and no redirect).",
        "If the follow-up check indicates not claimed (or the check cannot be performed), the UI shows a single friendly error message indicating the claim failed and the user can retry.",
        "The UI must not display backend error text such as \"Unauthorized: Only admins can assign user roles\" (or close variants) verbatim to the user in the claim flow."
      ]
    }
  ],
  "constraints": [
    "Do not create, edit, or reference any backend code; `backend/main.mo` must remain untouched.",
    "Respect frontend immutable paths; do not edit any files under `frontend/src/components/ui`, `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts`, or `frontend/src/main.tsx`.",
    "Limit code changes to allowed frontend scope (only `frontend/src/App.tsx` and files under `frontend/src/pages/**`).",
    "Keep the existing overall InternalLogin layout/styling; only make the minimal UI/logic changes needed to fix claim timing and claim behavior."
  ],
  "nonGoals": [
    "Do not add new backend methods or change backend authorization rules.",
    "Do not introduce real submission flows for registration pages or add API calls to other pages.",
    "Do not redesign routing or add new routes beyond the existing app structure."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}