{
  "kind": "build_request",
  "title": "InternalLogin: separate Superadmin claim card (no role selection needed) and hide after claim",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-94",
      "text": "Update ONLY `frontend/src/pages/internal/InternalLogin.tsx` to show a dedicated, separate \"Claim Superadmin\" card/section that does not require selecting the \"superadmin\" role first. The claim section must be visible only when the user is logged in with Internet Identity (`iiLoggedIn === true`), the one-time claim-check has completed (`claimCheckDone === true`), and `superadminClaimed === false`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Boleh lakukan itu dan pisahkan card claim superadminnya sehingga tidak perlu pilih role superadmin dulu tetap hilangkan cardnya apabila sudah berhasih terclaim"
        ]
      },
      "acceptanceCriteria": [
        "When II is logged in, the Superadmin claim UI is shown even if `selectedRole` is not `\"superadmin\"`.",
        "The claim UI is hidden when `superadminClaimed === true` (including immediately after a successful claim, and when the initial `isSuperadminClaimed()` check indicates it is already claimed).",
        "The role selection grid remains functional and still requires a role selection for the \"Ruang kerja\" action (no change to existing gating for \"Ruang kerja\")."
      ]
    },
    {
      "id": "REQ-95",
      "text": "In `frontend/src/pages/internal/InternalLogin.tsx`, harden the \"Claim Superadmin\" click handler so it never calls the backend when the actor is not ready. If `actor` is null/undefined OR `actorFetching` is true, the handler must exit early and show a non-crashing inline warning (reuse the existing warning mechanism) instead of attempting the call.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "masalahnya bukan warning agent, tetapi actor belum siap sehingga tombol \"Claim Superadmin\" memicu pesan: Backend belum siap, tunggu sebentar lalu coba lagi"
        ]
      },
      "acceptanceCriteria": [
        "Clicking \"Claim Superadmin\" while the actor is not ready does not throw, does not crash, and does not attempt any backend call.",
        "An inline warning is displayed via the existing `warningText` UI area when actor is not ready."
      ]
    },
    {
      "id": "REQ-96",
      "text": "Keep the Superadmin claim mutation behavior unchanged except for the UI placement: the claim action must call ONLY `actor.claimSuperadmin()` and must not call any other backend mutation (directly or indirectly). On success, set `superadminClaimed = true`, hide the claim card, and navigate to `/superadmin/dashboard`. If the backend indicates the superadmin is already claimed, set `superadminClaimed = true`, hide the claim card, and show an inline warning message (no redirect in that case).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "pisahkan card claim superadminnya ... tetap hilangkan cardnya apabila sudah berhasih terclaim"
        ]
      },
      "acceptanceCriteria": [
        "The only backend call made by the claim action is `actor.claimSuperadmin()`.",
        "On successful claim, the app navigates to `/superadmin/dashboard` and the claim card is no longer rendered on the Internal Login page.",
        "If claim fails because it was already claimed, the claim card is hidden and a warning is shown; no redirect occurs.",
        "No other pages or files are modified."
      ]
    }
  ],
  "constraints": [
    "Do not create, edit, or reference any backend code.",
    "Only modify `frontend/src/pages/internal/InternalLogin.tsx` (no other frontend files).",
    "Do not change shared hooks (`useActor`, `useInternetIdentity`) or any immutable paths listed in SYSTEM_CONTEXT.",
    "All other pages must remain UI-only and unchanged."
  ],
  "nonGoals": [
    "Changing routes or dashboards.",
    "Adding new backend methods or modifying backend authorization/claim logic.",
    "Adding new form fields for claiming superadmin.",
    "Implementing any additional role/registration flows beyond the existing InternalLogin decision tree."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}