{
  "kind": "build_request",
  "title": "InternalLogin: hide Claim Superadmin until actor ready and switch II button to Logout after login",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-97",
      "text": "Patch `frontend/src/pages/internal/InternalLogin.tsx` so the \"Claim Superadmin\" section is not visible and not actionable until the backend actor is fully ready, preventing the repeated \"Backend belum siap\" warning when a user clicks too early.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Oke lakukan patchnya",
          "Bisakah kamu mengecek kenapa selalu backend belum siap?"
        ]
      },
      "acceptanceCriteria": [
        "When `iiLoggedIn === true` but `actor` is null/undefined OR `actorFetching === true`, the Claim Superadmin card/section is hidden (not rendered).",
        "When the actor becomes ready (`actor` is non-null and `actorFetching === false`), the Claim Superadmin card/section becomes eligible to render again (still respecting existing rules like `claimCheckDone === true` and `superadminClaimed === false`).",
        "The Claim Superadmin click handler still early-returns without calling the backend when `actor` is null/undefined or `actorFetching === true`, and shows a non-crashing inline warning using the existing warning mechanism.",
        "No other pages or files are modified."
      ]
    },
    {
      "id": "REQ-98",
      "text": "Patch `frontend/src/pages/internal/InternalLogin.tsx` so the Internet Identity button changes from a post-login state to a true logout action: once II login succeeds, the button label becomes \"Logout\" and clicking it logs the user out (clears identity).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "pastikan kalau II sudah berhasil login berubah menjadi logout"
        ]
      },
      "acceptanceCriteria": [
        "When not logged in, the button label remains \"Login Internet Identity\" (or the existing loading label when `loginStatus === 'logging-in'`).",
        "When logged in (`iiLoggedIn === true`), the button label is \"Logout\" and the button is enabled.",
        "Clicking \"Logout\" calls the Internet Identity context clear/logout function (do not add any new auth system).",
        "After logout, `iiLoggedIn` becomes false and role selection + warnings are reset to a safe default UI state (no crashes; the page remains usable)."
      ]
    }
  ],
  "constraints": [
    "Do not create, edit, or reference any backend code.",
    "Modify only `frontend/src/pages/internal/InternalLogin.tsx` for this patch; do not change other frontend files.",
    "Keep the existing InternalLogin flow logic and superadmin-claim mutation behavior intact (claim still calls ONLY `actor.claimSuperadmin()` and no other backend mutations)."
  ],
  "nonGoals": [
    "Implementing registration flows or enabling other pages’ login buttons.",
    "Changing routes, dashboards, or adding new backend readiness APIs.",
    "Adding any new UI component library dependencies."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}