{
  "kind": "build_request",
  "title": "Fix InternalLogin Superadmin claim to call claimSuperadmin and avoid unauthorized role-assignment path",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-91",
      "text": "Update `frontend/src/pages/internal/InternalLogin.tsx` so the \"Claim Superadmin\" action calls ONLY the backend method `actor.claimSuperadmin()` and does not call (directly or indirectly from this click handler) any profile/role-assignment methods such as `saveCallerUserProfile()` that can trigger the backend error \"Unauthorized: Only admins can assign user roles\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Oke patch InternalLogin.tsx",
          "tapi saya tidak bisa claim superadmin"
        ]
      },
      "acceptanceCriteria": [
        "Clicking \"Claim Superadmin\" results in a single backend call to `claimSuperadmin()` (no other backend mutation calls from that click).",
        "The UI no longer shows the backend error \"Unauthorized: Only admins can assign user roles\" as a result of clicking \"Claim Superadmin\" when the caller is eligible to claim superadmin."
      ]
    },
    {
      "id": "REQ-92",
      "text": "In `frontend/src/pages/internal/InternalLogin.tsx`, add a one-time on-mount check that calls `actor.isSuperadminClaimed()` exactly once (when an actor is available) and uses its result to set `superadminClaimed`, so the claim UI is only offered when superadmin has not yet been claimed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Oke patch InternalLogin.tsx"
        ]
      },
      "acceptanceCriteria": [
        "`isSuperadminClaimed()` is invoked exactly once per page mount when an actor is available, and its result updates `superadminClaimed`.",
        "When `isSuperadminClaimed()` returns true, the \"Claim Superadmin\" button is not shown even if the user selects the Superadmin role.",
        "When `isSuperadminClaimed()` returns false, the \"Claim Superadmin\" button is shown only when `iiLoggedIn === true` and `selectedRole === \"superadmin\"`."
      ]
    },
    {
      "id": "REQ-93",
      "text": "Harden `frontend/src/pages/internal/InternalLogin.tsx` against actor readiness issues: prevent backend calls for claim/check actions when the actor is still initializing, and show a non-crashing inline warning instead of attempting the call.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ada warning backend belum siap",
          "tapi saya tidak bisa claim superadmin dan hanya muncul itu saja"
        ]
      },
      "acceptanceCriteria": [
        "If the actor is null/undefined or still fetching, clicking \"Claim Superadmin\" does not throw and does not attempt a backend call; an inline warning is shown instead.",
        "If the actor is null/undefined or still fetching, clicking \"Ruang kerja\" does not throw and does not attempt a backend call; an inline warning is shown instead.",
        "The page renders without runtime errors when the user is anonymous (not logged in) and when backend calls fail."
      ]
    }
  ],
  "constraints": [
    "Modify only `frontend/src/pages/internal/InternalLogin.tsx`.",
    "Do not modify any backend files (including `backend/main.mo`).",
    "Do not modify shared hooks in immutable paths (e.g., `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useActor.ts`).",
    "Do not add API calls or role/user checks to any other pages; only `InternalLogin.tsx` may call the backend.",
    "Keep the existing page layout structure (centered container, main card, footer); add only minimal UI needed for the fix."
  ],
  "nonGoals": [
    "Changing or removing the console warning about both `agent` and `agentOptions` passed to `createActor`.",
    "Implementing or modifying any backend authorization rules, access control initialization, or admin token handling.",
    "Adding new routes or changing route mappings elsewhere in the app."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}