{
  "kind": "build_request",
  "title": "Client dashboard: phase-based workspace (no tabs)",
  "projectName": "Asistenku",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-223",
      "text": "Modify ONLY `frontend/src/pages/dashboards/ClientDashboard.tsx` to convert the Client dashboard into a single-page, phase-based workspace (no tabs, no new routes, no new files), using real backend reads on mount to fetch the client’s active service and tasks, then rendering either (A) an inactive-service waiting screen or (B) an active workspace with a vertical narrative bucket list and filtered task cards, exactly following the provided phase mapping and cancel-visibility rules while keeping the existing dashboard styling largely intact (only small adjustments for max width ~720px, premium muted feel, and the vertical-line narrative styling).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10",
          "msg-12"
        ],
        "quotes": [
          "SCOPE: Edit hanya file: frontend/src/pages/dashboards/ClientDashboard.tsx\n\nJangan ubah backend. Jangan ubah routing. Jangan buat page baru. Jangan buat tab baru.",
          "Aturan lama “dashboard lain harus statis/UI-only” SUDAH DICABUT untuk ClientDashboard.\nClientDashboard diizinkan jadi dinamis penuh (fetch + state + API calls) ... semua perubahan dilakukan hanya di 1 file: ClientDashboard.tsx."
        ]
      },
      "acceptanceCriteria": [
        "Only `frontend/src/pages/dashboards/ClientDashboard.tsx` is changed; no other frontend/backend files, routes, or pages are modified/created.",
        "On initial mount, the page triggers exactly two reads: (1) `getMyActiveServicesV4()` (or the existing equivalent active-service query available on the generated actor typings) and (2) `listMyTasks()`. Results are stored in local state at minimum: `hasActiveService`, `tasks`, and `activeBucket` (default `null`).",
        "If `hasActiveService === false`, the dashboard renders a centered, whitespace-rich waiting message exactly as provided and then stops (does not render the workspace UI, buckets, or task list).",
        "If `hasActiveService === true`, the dashboard renders a single-page workspace (no tabs, no dropdown bucket picker) with: (1) a premium/luxury greeting area, (2) a 4-row vertical-line narrative list (clickable rows), (3) a task list showing cards filtered by the currently selected bucket, and (4) a collapsible History (Riwayat) section.",
        "The TaskPhase-to-bucket mapping is implemented exactly as locked: Delegation bucket = `#permintaan_baru` + `#ditolak_partner`; On Progress bucket = `#on_progress` + `#qa_asistenku`; Review bucket = `#review_client`; Revisi bucket = `#revisi`; Done bucket = `#selesai`. The phase `#dibatalkan_client` is excluded from the main workspace buckets and appears only under History.",
        "Delegation narrative detail is implemented: for tasks in `#permintaan_baru` (and for `#ditolak_partner` using the same copy, without using the word “ditolak”), show the first message only when `unitTerpakai == null` AND `assignedPartner == null`; otherwise show the second message.",
        "Cancel button visibility rule is enforced strictly on each task card: Cancel is shown only when `phase == #permintaan_baru` AND `unitTerpakai == null` AND `assignedPartner == null`. When delegation has started (unitTerpakai or assignedPartner exists), Cancel is not shown.",
        "The Status Narrative list contains exactly 4 rows in this order: Review (with subtle gold accent), On Progress, Delegation, and Selesai (collapsible). Each row shows a count in the sentence; when count is 0 it uses muted styling; when count > 0 it is more prominent. Clicking a row sets `activeBucket` and filters the task list accordingly.",
        "Task cards render at minimum: Title, short detail, a narrative phase label (not an aggressive badge), and UpdatedAt. For `#review_client`, a “Review” button is shown (no automatic navigation required). For `#revisi`, show the exact text “Sedang disempurnakan”. For fresh `#permintaan_baru`, show Cancel per the rule.",
        "The layout is constrained to a centered container with max width approximately 720px, headings use a serif style (left-aligned), body text uses a warm sans style, the vertical narrative line uses a subtle gold tone, and the design avoids harsh badges and red warning styling.",
        "All backend interactions are defensive and non-crashing: if the actor is not ready or calls fail/throw or return unexpected shapes, the page shows a calm inline error state and continues to render without runtime errors."
      ]
    },
    {
      "id": "REQ-224",
      "text": "Run a compile/runtime sanity pass focused on the updated `frontend/src/pages/dashboards/ClientDashboard.tsx` to confirm there are no TypeScript errors, the page does not crash when the backend actor is initializing, and both modes (no active service vs active workspace) render correctly with empty task lists and mixed task phases.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10",
          "msg-12"
        ],
        "quotes": [
          "Implement only the logic and UI structure described above inside ClientDashboard.tsx.",
          "ClientDashboard diizinkan jadi dinamis penuh (fetch + state + API calls) ... Tidak boleh bikin file baru, tidak boleh ubah routing, tidak boleh ubah dashboard lain."
        ]
      },
      "acceptanceCriteria": [
        "The project builds with zero TypeScript errors after the change.",
        "ClientDashboard renders without a blank screen in these scenarios: (1) actor still initializing / unavailable, (2) active service list empty, (3) tasks list empty, (4) tasks contain phases across all mapped buckets including `#dibatalkan_client` (which appears only in History).",
        "No automatic route changes are introduced; any navigation (if any) is only triggered by explicit user button clicks."
      ]
    }
  ],
  "constraints": [
    "Edit ONLY `frontend/src/pages/dashboards/ClientDashboard.tsx`.",
    "Do not modify any backend files.",
    "Do not modify routing (`frontend/src/App.tsx`) or introduce new routes.",
    "Do not create new files or new pages.",
    "Do not add tabs to the Client dashboard.",
    "Keep the existing dashboard styling largely intact; only apply small adjustments required by the spec (centered max-width ~720px, vertical narrative styling, muted/premium feel)."
  ],
  "nonGoals": [
    "Implementing or changing any backend task/service logic or endpoints.",
    "Adding real navigation flows for “Review” or “Cancel” beyond what the specification explicitly requires.",
    "Global redesign/theme changes across other dashboards or pages."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}