{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "InternalLogin actor readiness gating + Internet Identity logout button",
  "requirements": [
    {
      "id": "REQ-97",
      "summary": "Hide and disable Claim Superadmin UI until the backend actor is ready, while keeping the existing inline warning guard in the click handler.",
      "acceptanceCriteria": [
        "When `iiLoggedIn === true` but `actor` is null/undefined OR `actorFetching === true`, the Claim Superadmin card/section is hidden (not rendered).",
        "When the actor becomes ready (`actor` is non-null and `actorFetching === false`), the Claim Superadmin card/section becomes eligible to render again (still respecting existing rules like `claimCheckDone === true` and `superadminClaimed === false`).",
        "The Claim Superadmin click handler still early-returns without calling the backend when `actor` is null/undefined or `actorFetching === true`, and shows a non-crashing inline warning using the existing warning mechanism.",
        "No other pages or files are modified."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/internal/InternalLogin.tsx",
          "operation": "modify",
          "description": "Gate Claim Superadmin section rendering behind an explicit actor-ready check (e.g., require `!!actor && !actorFetching` in addition to the existing `iiLoggedIn && claimCheckDone && !superadminClaimed` rules) so the card is not visible/actionable until the actor is fully ready; keep the existing early-return + inline warning behavior in `handleClaimSuperadmin` intact. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-98",
      "summary": "Change the Internet Identity button to become a real Logout action after successful login and reset InternalLogin UI state safely on logout.",
      "acceptanceCriteria": [
        "When not logged in, the button label remains \"Login Internet Identity\" (or the existing loading label when `loginStatus === 'logging-in'`).",
        "When logged in (`iiLoggedIn === true`), the button label is \"Logout\" and the button is enabled.",
        "Clicking \"Logout\" calls the Internet Identity context clear/logout function (do not add any new auth system).",
        "After logout, `iiLoggedIn` becomes false and role selection + warnings are reset to a safe default UI state (no crashes; the page remains usable)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/internal/InternalLogin.tsx",
          "operation": "modify",
          "description": "Update the auth button to behave as Login/Logout using the existing Internet Identity context (use `clear()` from `useInternetIdentity`) so that when `iiLoggedIn` is true the label becomes \"Logout\" and clicking it clears identity; ensure the button is only disabled during `loginStatus === 'logging-in'`. On logout, reset InternalLogin local UI state to safe defaults (e.g., selected role, warnings, in-flight flags, claim-check flags/ref) so the page remains usable without crashes. Use the selected \"authorization\" component’s Internet Identity context capability for logout/clear behavior; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}