{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Patch InternalLogin superadmin claim flow and actor-readiness guards",
  "requirements": [
    {
      "id": "REQ-91",
      "summary": "Ensure \"Claim Superadmin\" click only triggers actor.claimSuperadmin() and avoids any role/profile assignment side effects",
      "acceptanceCriteria": [
        "Clicking \"Claim Superadmin\" results in a single backend call to `claimSuperadmin()` (no other backend mutation calls from that click).",
        "The UI no longer shows the backend error \"Unauthorized: Only admins can assign user roles\" as a result of clicking \"Claim Superadmin\" when the caller is eligible to claim superadmin."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/internal/InternalLogin.tsx",
          "operation": "modify",
          "description": "Adjust the Claim Superadmin click handler to call ONLY `actor.claimSuperadmin()` and keep it isolated from any other backend-mutation logic (e.g., no profile save/role assignment calls triggered directly or indirectly from this handler). Ensure success/error handling remains purely UI-state updates + navigation."
        }
      ]
    },
    {
      "id": "REQ-92",
      "summary": "Add a one-time on-mount superadmin-claimed check via actor.isSuperadminClaimed() to control claim UI visibility",
      "acceptanceCriteria": [
        "`isSuperadminClaimed()` is invoked exactly once per page mount when an actor is available, and its result updates `superadminClaimed`.",
        "When `isSuperadminClaimed()` returns true, the \"Claim Superadmin\" button is not shown even if the user selects the Superadmin role.",
        "When `isSuperadminClaimed()` returns false, the \"Claim Superadmin\" button is shown only when `iiLoggedIn === true` and `selectedRole === \"superadmin\"`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/internal/InternalLogin.tsx",
          "operation": "modify",
          "description": "Add a guarded on-mount effect that calls `actor.isSuperadminClaimed()` exactly once when the actor is available and not fetching (use a ref/flag to prevent re-invocation on re-renders). Store the result in `superadminClaimed` and update the claim button visibility logic accordingly. If typing is missing for `isSuperadminClaimed`, call it in a type-safe way (e.g., narrow/cast locally) without changing shared hooks or other files."
        }
      ]
    },
    {
      "id": "REQ-93",
      "summary": "Prevent claim/check actions from calling backend while actor is initializing; show inline warning instead of crashing",
      "acceptanceCriteria": [
        "If the actor is null/undefined or still fetching, clicking \"Claim Superadmin\" does not throw and does not attempt a backend call; an inline warning is shown instead.",
        "If the actor is null/undefined or still fetching, clicking \"Ruang kerja\" does not throw and does not attempt a backend call; an inline warning is shown instead.",
        "The page renders without runtime errors when the user is anonymous (not logged in) and when backend calls fail."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/internal/InternalLogin.tsx",
          "operation": "modify",
          "description": "Harden actor readiness checks for both \"Ruang kerja\" and \"Claim Superadmin\" actions by gating backend calls on `actor` presence and `actorFetching === false`. When not ready, set a non-crashing inline `warningText` (reuse existing warning UI) and return early without invoking backend. Also ensure all async handlers keep try/catch/finally so backend failures never crash rendering, including anonymous-user scenarios."
        }
      ]
    }
  ]
}