{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "InternalLogin: separate Superadmin claim card and harden claim handler",
  "requirements": [
    {
      "id": "REQ-94",
      "summary": "Separate the \"Claim Superadmin\" UI into its own dedicated card/section that appears independent of role selection and hides once claimed.",
      "acceptanceCriteria": [
        "When II is logged in, the Superadmin claim UI is shown even if `selectedRole` is not `\"superadmin\"`.",
        "The claim UI is hidden when `superadminClaimed === true` (including immediately after a successful claim, and when the initial `isSuperadminClaimed()` check indicates it is already claimed).",
        "The role selection grid remains functional and still requires a role selection for the \"Ruang kerja\" action (no change to existing gating for \"Ruang kerja\")."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/internal/InternalLogin.tsx",
          "operation": "modify",
          "description": "Move the \"Claim Superadmin\" button out of the role grid and into a separate dedicated card/section. Render this claim section only when `iiLoggedIn === true`, `claimCheckDone === true`, and `superadminClaimed === false`, without requiring `selectedRole === \"superadmin\"`. Keep the existing role selection + \"Ruang kerja\" gating behavior unchanged."
        }
      ]
    },
    {
      "id": "REQ-95",
      "summary": "Prevent \"Claim Superadmin\" from calling the backend when the actor is not ready, and show an inline warning instead.",
      "acceptanceCriteria": [
        "Clicking \"Claim Superadmin\" while the actor is not ready does not throw, does not crash, and does not attempt any backend call.",
        "An inline warning is displayed via the existing `warningText` UI area when actor is not ready."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/internal/InternalLogin.tsx",
          "operation": "modify",
          "description": "Harden `handleClaimSuperadmin` to exit early when `actor` is null/undefined OR `actorFetching` is true, and set a non-crashing inline warning using the existing `warningText` mechanism (do not attempt any backend call in this state)."
        }
      ]
    },
    {
      "id": "REQ-96",
      "summary": "Keep claim mutation behavior the same (only `actor.claimSuperadmin()`), but update UI behavior to hide the claim card after success/already-claimed and navigate only on success.",
      "acceptanceCriteria": [
        "The only backend call made by the claim action is `actor.claimSuperadmin()`.",
        "On successful claim, the app navigates to `/superadmin/dashboard` and the claim card is no longer rendered on the Internal Login page.",
        "If claim fails because it was already claimed, the claim card is hidden and a warning is shown; no redirect occurs.",
        "No other pages or files are modified."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/internal/InternalLogin.tsx",
          "operation": "modify",
          "description": "Ensure the claim action calls ONLY `actor.claimSuperadmin()` and no other backend mutations. On success: set `superadminClaimed = true` and navigate to `/superadmin/dashboard` (claim card hides due to render condition). If the backend indicates it is already claimed: set `superadminClaimed = true`, hide the claim card, and show an inline warning; do not navigate in that case."
        }
      ]
    }
  ]
}